[{"id":"0.09212914648263082","order":"1","blog":"<li>\r\n<b>This is the title of my first blog post</b>\r\n</li>\r\n<li>\r\n<h5>January 1st 2021</h5>\r\n</li>\r\n<li>\r\n<p>Artificial intelligence (AI) mimics human behavior and cognitive functions and is currently being used to bring substantial changes to the NHS. The use of AI in the health services is on the rise, the idea is to model a real living organism with a brain; a sensory system which collects data of every aspect of the healthcare service, helping to care for families and freeing up time for health professionals.\r\n\r\nAs funding declines it is unlikely to meet increasing demand, bridging this gap will require creative thinking around the use of AI. Since the NHS has formed people are living longer and chronic diseases now account for 70 percent of the healthcare spend. Due to issues around the level of knowledge and complexity, healthcare professionals can be supported by AI to ensure that they can meet the ever-increasing demands. This is where AI shows its strength, as it can support professionals whilst cutting costs at the same time.\r\n\r\nHealth Secretary Matt Hancock said: “Artificial intelligence will play a crucial role in the future of the NHS and we need to embrace it by introducing systems which can speed up diagnoses, improve patient outcomes, make every pound go further and give clinicians more time with their patients”(Telegraph, 2018).</p>\r\n</li>\r\n<li>\r\n<img src=\"http://www.lukemurphy.info/wp-content/uploads/2019/02/020319_1044_Thefutureof1.png\">\r\n</li>"},{"id":"0.20277754053241548","order":"2","blog":"<li>\r\n<b>INTEGRATING THE INTERNET OF THINGS (IOT) & THE CLOUD – FOR THE NON-TECHNICAL</b>\r\n</li>\r\n<li>\r\n<h5>January 10th 2021</h5>\r\n</li>\r\n<li>\r\n<p>1. IoT is not new to healthcare as they currently use sensors to gather vital patient data. However, if paired with Cloud technology, healthcare providers are able to send that data over a network, to share with other healthcare professionals once the data is processed. This would mean there would be no need for IT expertise within the medical center, though particular attention must be taken when dealing with privacy and security of the data.\r\n\r\n2. We are currently in the era of self-driving cars, many of the cars today already have many built-in IoT technology. We have parking sensors and computers that tell us what is wrong with the car. Again, paired with Cloud technology, we can gather and process more data than ever. Imagine a world where traffic lights and cars talk to one another and the car stops automatically on red. Furthermore, using CloudIoT, able to redirect the car to a different traffic route when then the one you have chosen has bottle-necked.\r\n\r\n3. Video surveillance is a huge industry, we already use this on a daily and widespread use throughout the world. CCTV is already hooked up to IoT and is used by not only business and governments but also the private sector. Cloud technology could help identify wrongdoers in real time and at extreme speeds.</p>\r\n</li>\r\n<li>\r\n<img src=\"https://ichef.bbci.co.uk/news/976/cpsprodpb/1572B/production/_88615878_976x1024n0037151.jpg\">\r\n</li>"}]