[{"order":"1","title":"Your Resume in 7.4 Seconds","blog":"<li>\r\n<h5>January 15th 2021 | By Matthew Strange</h5>\r\n</li>\r\n\r\n<li>\r\n<img src=\"https://fj-employer-blog.s3.amazonaws.com/employer-blog/wp-content/uploads/2019/04/18060705/Remote-Resume.png\">\r\n</li>\r\n\r\n<li>\r\n<b>Resume: what to include</b>\r\n</li>\r\n\r\n<li>\r\n<p>As seen by a study done by Ladders, recruiters only spend an average of 7.4 seconds looking at your resume. You need to make the most of this time, allowing recruiters to get to the meat of your resume as soon as possible. The following is some of my own advice that I’ve come up with over the years on how to make the most of those seven seconds.\r\n\r\n<span style=\"font-weight: bold;\">Header:</span> Don’t put excess information in your header. Your header should really only include your name, cellphone, email, address, and possibly your job title. For your address there’s no need to put your entire address with your street, zip, etc. You really only need your state/providence and possibly your country depending on where you’re applying from. The recruiter won’t care what street you lived on so there’s no need for the excess information.\r\n\r\n<span style=\"font-weight: bold;\">Introduction:</span> Don’t put an introduction. While common in the past, there is no longer any need to use so much space for something that isn't needed; if they want to know more about you, that's what LinkedIn is for.  If a recruiter is only spending about seven seconds looking at your resume, they won’t be spending that time reading your intro; at least you better hope they won’t be. Instead you want their attention drawn to other important sections, like your experience, education, and skills. \r\n\r\n<span style=\"font-weight: bold;\">Education:</span> This one is pretty clear cut. If you're in school, or a recent graduate, put your education before your experience and include your GPA. Otherwise, put your education after you experience and without your GPA.\r\n\r\n<span style=\"font-weight: bold;\">Experience:</span> Your job title, company, date of employment, location, and description should be the only things going here. In the past I’ve had resumes with descriptions of the companies, but this is just extra fluff that the recruiters won’t be interested in, or if they are interested can later google it. Your dates should only contain the month and the year to keep things as simple as possible. Be detailed with your descriptions; the more numbers and names you have here the better of you’ll be.\r\n\r\n</p>\r\n</li>\r\n\r\n<li>\r\n<b>Resume Tips</b>\r\n</li>\r\n\r\n<li>\r\n<p>Having trouble finding motivation or knowing the direction you want to go with your resume? Take your dream job and create the ideal resume for that job. What skills does it have? What does the education look like? What experiences? Use it as a checklist of sorts to get to where you want to be. It’s an awesome thing to see your current resume turning into your dream resume.\r\n\r\nNowadays there's a lot of controversy on whether you should do a cover letter. I lean towards no, because I believe cover letters are a thing of the past; I've talked with different recruiters and many of them state they no longer read them.  While they used to be helpful for recruiters to see a candidate in more depth, we now have social media that gives insight into both our professional and personal life.\r\n\r\nHaving a hard getting that first job? That first internship? Just start your own company doing your own work and hire yourself as an employee. If you're into app development, start a company developing apps and put that on your resume. No doubt recruiters will eat that up.\r\n\r\nI would advise almost everyone to have their own resume website. You can only fit so much on your resume, so being able to showcase your work is a must. It’s also more dynamic than a resume and allows you more freedom to express who you are among a sea of other candidates. Plus, adding that extra piece to your application helps you stand out among the competition as it gives you an extra level of professionalism.\r\n\r\n</p>\r\n</li>\r\n\r\n<li>\r\n<b>Final Thoughts and a Shameless Plug</b>\r\n</li>\r\n\r\n<li>\r\n<p>When creating your resume, you should be focusing on keeping the fluff to a bare minimum so the recruiters are more likely to see the content with actual substance. By doing this you will make the most out of your seven seconds and hopefully land that first interview to your dream job. As some examples, below are some links showing an older and a newer resume that will allow to see the above advice put into action.\r\n\r\nHere's my plug. For a lot of people, what’s stopping them from getting their own resume website is their lack of knowledge on how to acquire one. As a service I offer a pre-built resume website template that gives the user access to make modifications as their portfolio changes. Check it out on the services section of my blog and see what you think!\r\n\r\n</p>\r\n</li>\r\n\r\n<li>\r\n<b>References</b>\r\n</li>\r\n\r\n<li>\r\n<a href=\"http://go.theladders.com/rs/539-NBG-120/images/EyeTracking-Study.pdf\">Ladders Resume Study</a>\r\n</li>\r\n<li>\r\n<a href=\"https://i.ibb.co/0V8T3JK/Old-Resume.jpg\"> Old_Resume</a>\r\n</li>\r\n<li>\r\n<a href=\"https://i.ibb.co/bvg5dhh/New-Resume.jpg\">New_Resume</a>\r\n</li>\r\n\r\n\r\n"}]